# Part 4B Hypothesis Testing
-Loveida Lucero

**Imports**

In [1]:
# Import packages
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import glob
## Importing the OS and JSON Modules
import os,json
# importing plotly
import plotly.express as px
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

**Load Data**

In [2]:
# Use glob to get all filepaths that match the pattern (*=wildcard)
tmdb_files = sorted(glob.glob("Data/final_tmdb_data*.csv.gz"))
tmdb_files

['Data\\final_tmdb_data_2000.csv.gz',
 'Data\\final_tmdb_data_2001.csv.gz',
 'Data\\final_tmdb_data_2002.csv.gz',
 'Data\\final_tmdb_data_2003.csv.gz',
 'Data\\final_tmdb_data_2004.csv.gz',
 'Data\\final_tmdb_data_2005.csv.gz',
 'Data\\final_tmdb_data_2006.csv.gz',
 'Data\\final_tmdb_data_2007.csv.gz',
 'Data\\final_tmdb_data_2008.csv.gz',
 'Data\\final_tmdb_data_2009.csv.gz',
 'Data\\final_tmdb_data_2010.csv.gz',
 'Data\\final_tmdb_data_2011.csv.gz',
 'Data\\final_tmdb_data_2012.csv.gz',
 'Data\\final_tmdb_data_2013.csv.gz',
 'Data\\final_tmdb_data_2014.csv.gz',
 'Data\\final_tmdb_data_2015.csv.gz',
 'Data\\final_tmdb_data_2016.csv.gz',
 'Data\\final_tmdb_data_2017.csv.gz',
 'Data\\final_tmdb_data_2018.csv.gz',
 'Data\\final_tmdb_data_2019.csv.gz',
 'Data\\final_tmdb_data_2020.csv.gz',
 'Data\\final_tmdb_data_2021.csv.gz',
 'Data\\final_tmdb_data_2022.csv.gz']

In [3]:
# Use read_csv in a list comprehension and combine with concat to load all files
df = pd.concat([pd.read_csv(f) for f in tmdb_files] )
df

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.50,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.45,10.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.00,1.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,14204632.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.10,2369.0,PG
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3924,tt9888954,0.0,NaN,NaN,0.0,[],NaN,1183545.0,en,Reanimation Team,...,0.0,98.0,[],Released,NaN,Reanimation Team,0.0,0.00,0.0,NaN
3925,tt9893130,0.0,NaN,NaN,0.0,"[{'id': 27, 'name': 'Horror'}, {'id': 28, 'nam...",NaN,972731.0,en,"2025: Blood, White & Blue",...,0.0,135.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,THE PURGE meets US,"2025: Blood, White & Blue",0.0,7.00,2.0,NaN
3926,tt9893158,0.0,NaN,NaN,0.0,"[{'id': 80, 'name': 'Crime'}, {'id': 10749, 'n...",NaN,796955.0,en,Clowning,...,0.0,96.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Warm nights... Feels like death in the sand du...,Clowning,0.0,8.00,1.0,NaN
3927,tt9893160,0.0,/bsN0OyA6ZSQ3vkvNMaoNgp4woB6.jpg,NaN,0.0,"[{'id': 53, 'name': 'Thriller'}, {'id': 80, 'n...",NaN,606303.0,en,No Way Out,...,0.0,89.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Find what you love and let it kill you.,No Way Out,0.0,5.20,13.0,NaN
3928,tt9904648,0.0,/ibWj2ARVrAabIWDq5vSXoJRZfVV.jpg,NaN,0.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10749, '...",https://contrastmovie.com/,933557.0,en,The Contrast,...,0.0,82.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Everybody loves... somebody else.,The Contrast,0.0,3.00,1.0,NaN

# Prep Data for SQL Transfer

In [4]:
# find total movies with valid revenue
filter_revenue = df['revenue'] >0
filter_revenue.sum()

8145

In [5]:
# Filter out any movies with no revenue data as this is the target
df = df[filter_revenue]
df.info()
df.head(2)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8145 entries, 4 to 3911
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                8145 non-null   object
 1   adult                  8145 non-null   float64
 2   backdrop_path          7800 non-null   object
 3   belongs_to_collection  1570 non-null   object
 4   budget                 8145 non-null   float64
 5   genres                 8145 non-null   object
 6   homepage               3523 non-null   object
 7   id                     8145 non-null   float64
 8   original_language      8145 non-null   object
 9   original_title         8145 non-null   object
 10  overview               8112 non-null   object
 11  popularity             8145 non-null   float64
 12  poster_path            8099 non-null   object
 13  production_companies   8145 non-null   object
 14  production_countries   8145 non-null   object
 15  release_date           8130 non-null   object
 16  revenue                8145 non-null   float64
 17  runtime                8145 non-null   float64
 18  spoken_languages       8145 non-null   object
 19  status                 8145 non-null   object
 20  tagline                5803 non-null   object
 21  title                  8145 non-null   object
 22  video                  8145 non-null   float64
 23  vote_average           8145 non-null   float64
 24  vote_count             8145 non-null   float64
 25  certification          5335 non-null   object
dtypes: float64(9), object(17)
memory usage: 1.7+ MB

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,14204632.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.100,2369.0,PG
10,tt0120202,0.0,/tuerGhZ1lA8wpBjUCEUpeTWDT5B.jpg,NaN,0.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...",http://www.newline.com/properties/stateandmain...,21991.0,en,State and Main,...,9206279.0,106.0,"[{'english_name': 'Italian', 'iso_639_1': 'it'...",Released,Big movie. Small town. Huge trouble.,State and Main,0.0,6.327,185.0,NaN

In [6]:
print(f"There are {len(df)} movies with valid revenue.")

There are 8145 movies with valid revenue.

# Genres

## Normalize Genre Data

In [7]:
df['genres'].apply(pd.Series)

                                                      0
4     [{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...
10    [{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...
11    [{'id': 18, 'name': 'Drama'}, {'id': 35, 'name...
12    [{'id': 18, 'name': 'Drama'}, {'id': 27, 'name...
14    [{'id': 16, 'name': 'Animation'}, {'id': 35, '...
...                                                 ...
3893                      [{'id': 18, 'name': 'Drama'}]
3897  [{'id': 28, 'name': 'Action'}, {'id': 35, 'nam...
3904  [{'id': 35, 'name': 'Comedy'}, {'id': 10749, '...
3907  [{'id': 35, 'name': 'Comedy'}, {'id': 53, 'nam...
3911  [{'id': 18, 'name': 'Drama'}, {'id': 10402, 'n...

[8145 rows x 1 columns]

In [12]:
# separate the genres into rows
exploded_genres = df.explode('genres')
exploded_genres.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,14204632.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.100,2369.0,PG
10,tt0120202,0.0,/tuerGhZ1lA8wpBjUCEUpeTWDT5B.jpg,NaN,0.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...",http://www.newline.com/properties/stateandmain...,21991.0,en,State and Main,...,9206279.0,106.0,"[{'english_name': 'Italian', 'iso_639_1': 'it'...",Released,Big movie. Small town. Huge trouble.,State and Main,0.0,6.327,185.0,NaN
11,tt0120263,0.0,/ynXVuylP8upazjz8lrqb1PEMkdR.jpg,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 35, 'name...",NaN,34070.0,sv,Sånger från andra våningen,...,80334.0,99.0,"[{'english_name': 'Russian', 'iso_639_1': 'ru'...",Released,NaN,Songs from the Second Floor,0.0,7.200,249.0,NaN
12,tt0120467,0.0,/knok3mNReKqPTplnnqz7E4dd7mD.jpg,NaN,120000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 27, 'name...",NaN,19085.0,en,Vulgar,...,14904.0,87.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Everyone loves a clown... some more than others.,Vulgar,0.0,5.500,44.0,R
14,tt0120630,0.0,/xWG7emUlBPhsJ2MyQHqH0poeXwm.jpg,"{'id': 718551, 'name': 'Chicken Run Collection...",45000000.0,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",NaN,7443.0,en,Chicken Run,...,224834564.0,84.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,This ain't no chick flick. It's poultry in mot...,Chicken Run,0.0,6.763,4537.0,G

In [16]:
with open('/Users/Lovei/.secret/mysql.json')as f:
    login = json.load(f)
    
login.keys()

dict_keys(['username', 'password'])

In [17]:
connection  = f"mysql+pymysql://{login['username']}:{login['password']}@localhost/movies"
engine = create_engine(connection)
conn = engine.connect()

In [ ]:
# Load df to sql
#try:
#    genres.to_sql('genres', engine, index=False, if_exists='append')
#except Exception as e:
#    print('cannot append', e)

# Title_Genres

# Ratings

In [13]:
ratings = df[['imdb_id','vote_average','vote_count']].copy()
ratings.head(3)

      imdb_id  vote_average  vote_count
4   tt0118694         8.100      2369.0
10  tt0120202         6.327       185.0
11  tt0120263         7.200       249.0

In [14]:
rename_rating = {'imdb_id':'tconst',
                'vote_average':'average_rating',
                'vote_count':'number_of_votes'}
ratings = ratings.rename(rename_rating, axis=1)
ratings.head()

       tconst  average_rating  number_of_votes
4   tt0118694           8.100           2369.0
10  tt0120202           6.327            185.0
11  tt0120263           7.200            249.0
12  tt0120467           5.500             44.0
14  tt0120630           6.763           4537.0

In [ ]:
# Load df to sql
#try:
#    ratings.to_sql('ratings', engine, index=False, if_exists='append')
#except Exception as e:
#    print('cannot append', e)

# Title_Basics

In [15]:
title_basics = df[['imdb_id','original_title','release_date','runtime']].copy()
title_basics.head()

      imdb_id              original_title release_date  runtime
4   tt0118694                        花樣年華   2000-09-29     99.0
10  tt0120202              State and Main   2000-08-26    106.0
11  tt0120263  Sånger från andra våningen   2000-10-06     99.0
12  tt0120467                      Vulgar   2002-04-26     87.0
14  tt0120630                 Chicken Run   2000-06-23     84.0

In [20]:
#rename columns for consistency
rename_basics = {'imdb_id':'tconst',
                'original_title':'primary_title'}
title_basics = title_basics.rename(rename_basics, axis=1)
title_basics.info()
title_basics.head()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8145 entries, 4 to 3911
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         8145 non-null   object
 1   primary_title  8145 non-null   object
 2   release_date   8130 non-null   object
 3   runtime        8145 non-null   float64
dtypes: float64(1), object(3)
memory usage: 576.2+ KB

       tconst               primary_title release_date  runtime
4   tt0118694                        花樣年華   2000-09-29     99.0
10  tt0120202              State and Main   2000-08-26    106.0
11  tt0120263  Sånger från andra våningen   2000-10-06     99.0
12  tt0120467                      Vulgar   2002-04-26     87.0
14  tt0120630                 Chicken Run   2000-06-23     84.0

In [22]:
#split release date into separate columns and drop day/month
title_basics = title_basics.copy()
title_basics['release_date'] = pd.to_datetime(title_basics['release_date'],errors='coerce')
title_basics['start_year'] = title_basics['release_date'].dt.year
title_basics['month'] = title_basics['release_date'].dt.month
title_basics['day'] = title_basics['release_date'].dt.day
title_basics.head()

#collaborated with Christina Brockway

,tconst,primary_title,release_date,runtime,start_year,month,day
4,tt0118694,花樣年華,2000-09-29,99.0,2000.0,9.0,29.0
10,tt0120202,State and Main,2000-08-26,106.0,2000.0,8.0,26.0
11,tt0120263,Sånger från andra våningen,2000-10-06,99.0,2000.0,10.0,6.0
12,tt0120467,Vulgar,2002-04-26,87.0,2002.0,4.0,26.0
14,tt0120630,Chicken Run,2000-06-23,84.0,2000.0,6.0,23.0

In [23]:
cols_to_drop = ['release_date','month','day']
title_basics = title_basics.drop(columns=cols_to_drop)
title_basics.info()
title_basics.head()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8145 entries, 4 to 3911
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         8145 non-null   object
 1   primary_title  8145 non-null   object
 2   runtime        8145 non-null   float64
 3   start_year     8130 non-null   float64
dtypes: float64(2), object(2)
memory usage: 576.2+ KB

       tconst               primary_title  runtime  start_year
4   tt0118694                        花樣年華     99.0      2000.0
10  tt0120202              State and Main    106.0      2000.0
11  tt0120263  Sånger från andra våningen     99.0      2000.0
12  tt0120467                      Vulgar     87.0      2002.0
14  tt0120630                 Chicken Run     84.0      2000.0

In [28]:
title_basics['start_year'] = title_basics['start_year'].astype(int)
title_basics.dtype

KeyError: 'start_year'

In [ ]:
# Load df to sql
#try:
#    title_basics.to_sql('title_basics', engine, index=False, if_exists='append')
#except Exception as e:
#    print('cannot append', e)

# TMDB_Data

In [29]:
tmdb_data=df[['imdb_id','budget','revenue','certification']].copy()
tmdb_data.info()
tmdb_data.head(2)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8145 entries, 4 to 3911
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        8145 non-null   object
 1   budget         8145 non-null   float64
 2   revenue        8145 non-null   float64
 3   certification  5335 non-null   object
dtypes: float64(2), object(2)
memory usage: 576.2+ KB

      imdb_id    budget     revenue certification
4   tt0118694  150000.0  14204632.0            PG
10  tt0120202       0.0   9206279.0           NaN

## Consistnecy

In [30]:
tmdb_data['certification'].value_counts()

R         2429
PG-13     1745
PG         675
NR         346
G          122
NC-17       17
PG-13        1
Name: certification, dtype: int64

In [31]:
tmdb_data['certification'] = tmdb_data['certification'].replace({'PG-13 ':'PG-13'})
tmdb_data['certification'].value_counts()

R        2429
PG-13    1746
PG        675
NR        346
G         122
NC-17      17
Name: certification, dtype: int64

In [18]:
from sqlalchemy.types import *
# Make dictionary with column and datatype
tmdb_types = {"imdb_id":CHAR(12),
            "revenue":FLOAT(),
            "budget":FLOAT(),
            "certification":VARCHAR(7)}

In [19]:
# Load df to sql
tmdb_data.to_sql('tmdb_data', engine, dtype=tmdb_types, index=False, if_exists='replace')

14316

In [20]:
# Set primary key for tmdb_data
q = '''ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);'''
engine.execute(q)

C:\Users\Lovei\AppData\Local\Temp\ipykernel_18944\951478637.py:3: RemovedIn20Warning: Deprecated API features detected! These feature(s) are not compatible with SQLAlchemy 2.0. To prevent incompatible upgrades prior to updating applications, ensure requirements files are pinned to "sqlalchemy<2.0". Set environment variable SQLALCHEMY_WARN_20=1 to show all deprecation warnings.  Set environment variable SQLALCHEMY_SILENCE_UBER_WARNING=1 to silence this message. (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)
  engine.execute(q)

# Confirm Data Transfer in SQL

In [21]:
q = """SHOW TABLES;"""
pd.read_sql(q, conn)

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres
4        tmdb_data

In [22]:
#display tmdb_data db info
q = '''DESCRIBE tmdb_data;'''
describe_td = pd.read_sql(q, conn)
describe_td

           Field        Type Null  Key Default Extra
0        imdb_id    char(12)   NO  PRI    None
1         budget       float  YES         None
2        revenue       float  YES         None
3  certification  varchar(7)  YES         None

In [23]:
# Confirm data has been added
q = """
SELECT * FROM tmdb_data
LIMIT 5;
"""
pd.read_sql(q,engine)

     imdb_id      budget     revenue certification
0  tt0035423  48000000.0  76019000.0         PG-13
1  tt0069049  12000000.0         0.0             R
2  tt0088751    350000.0         0.0          None
3  tt0113026  10000000.0         0.0          None
4  tt0118589  22000000.0   5271670.0         PG-13